[
  {
    "id": 1,
    "text": "No unsolicited direct messages (DMs) or friend requests to other members of the Discord without explicit permission. You may DM members of the moderation team without asking *if you have an issue with another member in the Discord*."
  },

  {
    "id": 2,
    "text": "No personal drama or drama from any other discord community is allowed to be brought into this Discord. This is a space for infosec discussions and learning, keep it that way."
  },

  {
    "id": 3,
    "text": "No excessive self promotion. You are welcome to post livestreams, writeups, and videos *of THM content* in <#644263827742916628>; these should be submitted to the room in question and approved by the creator before being posted here (it goes without saying that 'writeups' which are just copy/pasted room content, or are answer dumps, are a big no-no). Please do not abuse this. Be respectful to other users -- we are not interested in seeing you repeatedly spam your own content.\nWhen in doubt, ask a moderator in the chat :)"
  },

  {
    "id": 4,
    "text": "Keep it civil. If action is necessary in a dispute or any other sort of Disruption on this discord punishment will be doled out evenly both to the individual(s) who started the issue and to those who reacted inappropriately in their response."
  },
  {
    "id": 5,
    "text": "No cheating is allowed whatsoever within this server (this includes asking for help with assessed schoolwork or exams, as well as any other environment where you are breaking the rules to gain an edge). Point duplication or point cheating of any kind on the TryHackMe website will result in a permanent ban from the site and Discord."
  },
  {
    "id": 6,
    "text": "Discrimination of any kind is not tolerated and will be met with punishment accordingly -- this will usually be a permanent ban from the community."
  },
  {
    "id": 7,
    "text": "Administrators reserve the right to modify the rules at any time and extend them accordingly to cover infractions which may not be currently included in these rules."
  },
  {
    "id": 8,
    "text": "Keep conversations SFW (Safe for work). This is an educational and professional environment, be sure that your words do not offend or make other members uncomfortable. If you wouldn't say it in front of your teacher, manager, or partner's grandmother, don't say it here!"
  },
  {
    "id": 9,
    "text": "No discussion of illegal/unethical topics or actions. If the target device doesn't belong to you and you don't have specific permission to perform an attack from the *owner* of the target, then you don't do it and we don't talk about it. This also applies to piracy / copyright violations -- illegally obtained materials (including classified or potentially classified materials) should *not* be posted here.\nIf in doubt, please ask a moderator before posting your message -- preferably without breaking rule 1. Whether an action is unethical or not is at the sole discretion of the moderation team. Be warned -- a community ban over ethical concerns may also be extended to a ban from the TryHackMe website; we do not teach blackhats."
  },
  {
    "id": 10,
    "text": "Do not post viruses or malicious files without explicit permission from the administrative staff. We understand that this is a discord for learning, however, there are plenty of places online to get malware for forensic examination and reverse engineering. This includes in the advanced channels."
  },
  {
    "id": 11,
    "text": "Linking to another discord server is strictly prohibited unless you have the infosec-developer role and the server is being linked as a resource to provide help with a specific resource (e.g. linking the Ciphey official Discord server for help with Ciphey)."
  },
  {
    "id": 12,
    "text": "The first time that you use a Nitro boost on the server you may pick a new server appropriate emote or sticker."
  },
  {
    "id": 13,
    "text": "When asking for help/tech support please perform research to your fullest ability and don't spam the chat if you don't get an answer to your question immediately. Research is the single most crucial skill in hacking, so it is in your best interests to practice it! Mods and Community Mentors are all volunteers and have the right to refuse helping those who have not done troubleshooting/research on their own first.\nIf you have researched your question and have not found an answer then you are more than welcome to ask for help with THM questions in any of the room help channels, or general infosec questions in <#760623494681067551>. Clearly phrase your questions as we (fortunately for all parties involved) cannot read your mind -- please include the room, task, and question number for THM content in your question if possible. A clearly phrased question is *much* easier to answer than a vague or generalised question, so just ask! :)\n<https://dontasktoask.com>"
  },
  {
    "id": 14,
    "text": "This server is exclusively English speaking for the purposes of moderation. This includes encoded or encrypted messages as well as other languages; if we can't read it without a translator, please don't post it <3."
  },
  {
    "id": 15,
    "text": "Please leave any disciplinary measures to the community staff (Mods, and Admins) -- this is also known as no 'mini-modding'. If something is happening, please just let the staff know and we can take care of it <3.\nIf a moderator is dealing with a situation, please do not get involved; if you are making the situation harder to handle by getting involved (however well intentioned you may be :hearts: ) you may simply be muted for a short time period whilst the moderator finishes clearing up.\nThis rule also includes no dog-piling -- be nice to others; if a situation needs dealt with, let a mod handle it. :)"
  },
  {
    "id": 16,
    "text": "No spamming, please. This includes excess repeating of the same messages and posting excessive amounts of material in the chat (e.g. massive walls of text, or multiple GIFS/Pictures). Moderators have final judgement in these cases."
  },
  {
    "id": 17,
    "text": "Do not intentionally mislead others with malicious intent, especially should this misleading end up in destruction of property or otherwise damaging things that don't belong to you. Things like rickrolling are still allowed, just don't lead someone to damaging their computer/system. Even if your intentions are not malicious, please remember that you are posting in public channels where people can (and unfortunately *will*) simply copy and paste commands that they see. Be mindful of what you post -- a system format command may be amusing in some situations, but it could still cause damage!"
  },
  {
    "id": 18,
    "text": "When asking other members for help (either with TryHackMe rooms or anything else), please be respectful of the time and knowledge that it takes for them to answer your question. Disregarding advice off-hand or otherwise being rude to the people electing to help is not acceptable, although please feel free to ask for an explanation if you'd like to discuss something! Please be courteous, listen to what people have to say, disagree *respectfully* (with a good reason) if you think they are incorrect, and overall treat people the way you would want to be treated. This rule applies regardless of who is involved in the discussion."
  },
  {
    "id": 19,
    "text": "Whilst TryHackMe is a learning platform first and foremost, we ask that you don't spoil new challenge rooms for other users -- room creators are free to override this to either allow spoilers or deny all help/writeups for a period of time. If you need help with a new challenge (and the creator hasn't specifically denied spoilers/help), consider waiting for a day or two before asking, or use ``||spoiler||`` tags to hide your question. :)\n**Note:** *If the challenge is part of a wider challenge event (community or site driven), you __must__ not ask for help, or help others. If an event falls into this category, it will be made clear in the room.*"
  }
]
